rescue-mission/app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 565]]
---
  def new
    @answer = Answer.new
    @question = Question.find(params[:question_id])

INSERT INTO "answers" ("created_at", "question_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-15 21:52:03.726111"], ["question_id", 201], ["updated_at", "2014-12-15 21:52:03.726111"]]
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @answer = Answer.create(question_id: params[:question_id], description: params[:answer][:description])
    @question = Question.find(params[:question_id])

SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" IS NULL
---
  def index
    @answers = Answer.where(question_id: params[:question_id])