rescue-mission/app/controllers/questions_controller.rb

  def index
    @questions = Question.order(created_at: :desc).all
---
SELECT "questions".* FROM "questions"   ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.create(question_params)
---
INSERT INTO "questions" ("description", "title") VALUES ($1, $2) RETURNING "id"  [["description", "What's the meaning of life?"], ["title", "This is a question"]]

  def update
    @question = Question.find(params[:id])
    @question.update(question_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 747]]
UPDATE "questions" SET "description" = $1, "title" = $2, "updated_at" = $3 WHERE "questions"."id" = 787

  def destroy
    Question.destroy(params[:id])
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 932]]