car-listings/app/controllers/cars_controller.rb

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 47]]
---
  def new
    @manufacturer = Manufacturer.find(params[:manufacturer_id])

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 7]]
INSERT INTO "cars" ("color", "year", "mileage", "description", "manufacturer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["color", "Blue"], ["year", 2015], ["mileage", 100000], ["description", "It's a car."], ["manufacturer_id", "11"]]
---
  def create
    @manufacturer = Manufacturer.find(params[:manufacturer_id])
    @car = @manufacturer.cars.build(car_params)
    if @car.save