car-listings/app/controllers/manufacturers_controller.rb

  def index
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def show
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 34]]

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save
---
INSERT INTO "manufacturers" ("name", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Toyota"], ["country", "Japan"], ["created_at", "2015-01-02 14:43:08.352134"], ["updated_at", "2015-01-02 14:43:08.352134"]]